'''
Завдання передбачає пошук "щасливих" квитків. "Щасливим" називається такий тролейбусний квиток, в якому сума перших трьох цифр дорівнює
сумі останніх трьох. Наприклад 030111 (0+3+0 = 1+1+1), 902326 (9+0+2 = 3+2+6), 001100 (0+0+1 = 1+0+0).

Вхідні дані: два цілих невід'ємних числа (0<=a1<=a2<=999999) - аргументи командного рядка.

Результат роботи: кількість "щасливих квитків", чиї номери лежать на проміжку від a1 до a2 включно. 
Якщо число на проміжку має менше 6 розрядів, вважати, що на його початку дописуються нулі у необхідній кількості, 
як це і відбувається при нумерації квитків. Виводити номери квитків не треба.

Наприклад
Вхідні дані: 0 1000
Приклад виклику: python lab4_4.py 0 1000
Результат: 1
Пояснення: номер 000000
Вхідні дані: 1001 1122
Приклад виклику: python lab4_4.py 1001 1122
Результат: 3
Пояснення: номери 001001, 001010, 001100
Вхідні дані: 222222 222333
Приклад виклику: python lab4_4.py 222222 222333
Результат: 7
Пояснення: номери 222222, 222231, 222240, 222303, 222312, 222321, 222330
'''

import sys

num1 = int(sys.argv[1])
num2= int(sys.argv[2])

happy=0

for num in range(num1,num2+1):
	sum1= (int(num/100000))+(int(num/10000)-int(num/100000)*10)+(int(num/1000)-int(num/10000)*10)
	sum2= (int(num/100)-int(num/1000)*10)+(int(num/10)-int(num/100)*10)+(int(num/1)-int(num/10)*10)
	#print(sum1)
	#print(sum2)
	if sum1==sum2:
		happy=happy+1
		
print(happy)
