'''
Розробити функцію super_fibonacci(n, m), 
яка приймає 2 аргументи -- додатні цілі числа n та m (0 < n, m <= 35), 
та повертає число -- n-й елемент послідовності супер-Фібоначчі порядку m.

Нагадуємо, що послідовність Фібоначчі -- це послідовність чисел, в якій кожний елемент дорівнює сумі двох попередніх. Послідовністю супер-Фібоначчі порядку m будемо вважати таку послідовність чисел, в якій кожний елемент дорівнює сумі m попередніх. Перші m елементів (з порядковими номерами від 1 до m) вважатимемо одиницями.

Наприклад
Виклик функції: super_fibonacci(2, 1)
Повертає: 1
Виклик функції: super_fibonacci(3, 5)
Повертає: 1
Виклик функції: super_fibonacci(8, 2)
Повертає: 21
Виклик функції: super_fibonacci(9, 3)
Повертає: 57
'''

def super_fibonacci(n, m):
	series=[]
	for i in range(m):
		series.append(1)
	for i in range(m,n):
		series_value=0
		for j in range(1,m+1):
			series_value=series_value+series[i-j]
		series.append(series_value)
	return series[n-1]

print(super_fibonacci(9,3))
