'''
Розробити функцію encode_morze(text), яка приймає 1 аргумент -- рядок, та повертає рядок, який містить діаграму сигналу, 
що відповідає переданому тексту, закодованому міжнародним кодом Морзе для англійського алфавіту. Розділові та інші знаки, 
що не входять до латинського алфавіту, ігнорувати. Регістром літер нехтувати.

Для передачі повідомлення за одиницю часу приймається тривалість однієї крапки. Тривалість тире дорівнює трьом крапкам. 
Пауза між елементами одного знака -- одна крапка, між знаками в слові -- 3 крапки, між словами -- 7 крапок. Словом вважати 
послідовність символів, обмежена пробілами. Результуюча "діаграма" демонструє наявність сигналу в кожний проміжок часу: 
на і-й позиції знаходиться "^", якщо в цей момент передається сигнал, і "_", якщо сигналу немає. Зайві паузи в кінці повідомлення 
на "діаграмі" відсутні.

Наприклад
Виклик функції: encode_morze('Morze code')
Повертає: ^^^_^^^___^^^_^^^_^^^___^_^^^_^___^^^_^^^_^_^___^_______^^^_^_^^^_^___^^^_^^^_^^^___^^^_^_^___^
Виклик функції: encode_morze('Prometheus')
Повертає: ^_^^^_^^^_^___^_^^^_^___^^^_^^^_^^^___^^^_^^^___^___^^^___^_^_^_^___^___^_^_^^^___^_^_^
Виклик функції: encode_morze('SOS')
Повертає: ^_^_^___^^^_^^^_^^^___^_^_^
Виклик функції: encode_morze('1')
Повертає: 
'''

morse_code = {
    "A" : ".-", 
    "B" : "-...", 
    "C" : "-.-.", 
    "D" : "-..", 
    "E" : ".", 
    "F" : "..-.", 
    "G" : "--.", 
    "H" : "....", 
    "I" : "..", 
    "J" : ".---", 
    "K" : "-.-", 
    "L" : ".-..", 
    "M" : "--", 
    "N" : "-.", 
    "O" : "---", 
    "P" : ".--.", 
    "Q" : "--.-", 
    "R" : ".-.", 
    "S" : "...", 
    "T" : "-", 
    "U" : "..-", 
    "V" : "...-", 
    "W" : ".--", 
    "X" : "-..-", 
    "Y" : "-.--", 
    "Z" : "--.."
}

def encode_morze(text):

	text = text.upper()
	result = []
	words = text.split(" ")
	#new_letter = []
	new_words = []
	for word in words:
		new_letter = []
		for letter in word:
			#new_letter = []
			new_morse_code = []
			if letter in morse_code:
				for i in morse_code[letter]:
					if i == ".":
						new_morse_code.append('^')
					if i == "-":
						new_morse_code.append('^^^')
				
					#new_l = '_'.join(result)
				new_l = '_'.join(new_morse_code)
				new_letter.append(new_l)
				#result = result + new_morse_code
				#print(new_letter)
				#print(result)
			else:
				pass
		newword = '___'.join(new_letter)	
		new_words.append(newword)
		#print(new_words)
	return '_______'.join(new_words)
