'''
Розробити функцію count_holes(n), 
яка приймає 1 аргумент -- ціле число або рядок, який містить ціле число, 
та повертає ціле число -- кількість "отворів" у десятковому записі цього числа друкованими цифрами 
(вважати, що у "4" та у "0" по одному отвору), або рядок ERROR, якщо переданий аргумент не задовольняє вимогам: 
є дійсним або взагалі не числом.

Незначущими нулями на початку запису числа, якщо такі є, нехтувати.

Наприклад
Виклик функціїі: count_holes('123')
Повертає: 0
Виклик функціїі: count_holes(906)
Повертає: 3
Виклик функціїі: count_holes('001')
Повертає: 0
Виклик функціїі: count_holes(-8)
Повертає: 2
Виклик функціїі: count_holes(-8.0)
Повертає: ERROR
'''

def count_holes(n):
    if type(n) != float:
        if type(n) == str:
            if n.isdigit():
                n = str(int(n))
            else:
                return 'ERROR'

        sum = 0
        for i in str(n):
            if i == '4' or i == '6' or i == '9' or i == '0':
                sum = sum + 1
            if i == '8':
                sum = sum + 2
        return sum


    elif type(n) == float:
        return 'ERROR'
